Documents/ИсключениеИзКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИсключениеИзКадровогоРезерва</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Наставничество</xr:Item>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеИсключенияИзКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПозицияРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРезерва</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСКадровымиРезервистами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗавершитьНаставничество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументОснованиеНаставничество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ДействияСКадровымиРезервистами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДействияСКадровымиРезервистами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оставить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИсключениеИзКадровогоРезерва/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Начальное заполнение
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		Объект.ДатаИсключения = Объект.Дата;
		Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
			Объект.Подразделение = Параметры.Подразделение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.УчастникКадровогоРезерва) Тогда
			Объект.УчастникКадровогоРезерва = Параметры.УчастникКадровогоРезерва;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.УчастникКадровогоРезерва) Тогда
			ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
			Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
				ЗаполнитьПодразделениеУчастникаКадровогоРезерва();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьВторичныеДанныеФормы();
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужбаФормы = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужбаФормы");
		МодульГосударственнаяСлужбаФормы.УстановитьПараметрыВыбораСотрудников(ЭтотОбъект, "УчастникКадровогоРезерва");
		МодульГосударственнаяСлужбаФормы.УстановитьВидимостьОснования(ЭтотОбъект, "Основание");
	КонецЕсли; 
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	КадровыйРезервФормы.УстановитьСвойстваТипаУчастникаКадровогоРезерва(ЭтотОбъект);
	КадровыйРезервФормы.УстановитьСвойстваУчастникаКадровогоРезерва(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.ПриСозданииНаСервереФормыИсключенияИзКадровогоРезерва(ЭтотОбъект, Элементы.Резерв);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьВторичныеДанныеФормы();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписаноИсключениеИзКадровогоРезерва");
	Оповестить("Запись_ИсключениеИзКадровогоРезерва", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.УчастникКадровогоРезерва = Неопределено;
	ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникКадровогоРезерваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипУчастникаКадровогоРезерва.СодержитТип(Тип("СправочникСсылка.ФизическиеЛица")) Тогда
		ОтборИзПодразделения = ОтборИзПодразделения(Объект.Подразделение);
		Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Организация");
		Подразделение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборИзПодразделения, "Подразделение");
		КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
			Элементы.УчастникКадровогоРезерва, Организация, Подразделение, Объект.ДатаИсключения, Ложь);
	ИначеЕсли ТипУчастникаКадровогоРезерва.СодержитТип(Тип("СправочникСсылка.ЛичныеДанныеКандидатов")) Тогда
		МодульПодборПерсоналаКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодборПерсоналаКлиент");
		Отбор = Новый Структура;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			Отбор.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		МодульПодборПерсоналаКлиент.ПодобратьКандидатов(Элемент, Отбор, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникКадровогоРезерваОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработкаВыбораУчастникаКадровогоРезерва(ВыбранноеЗначение);
	ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникКадровогоРезерваПриИзменении(Элемент)
	
	ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ЗаполнитьПодразделениеУчастникаКадровогоРезерва();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаИсключенияПриИзменении(Элемент)
	
	ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипУчастникаКадровогоРезерваПриИзменении(Элемент)
	
	ТипУчастникаКадровогоРезерваПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипУчастникаКадровогоРезерваОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезерв

&НаКлиенте
Процедура РезервПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РезервПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_РезервЗавершитьНаставничествоПриИзменении(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничествоКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НаставничествоКлиент");
		МодульНаставничествоКлиент.РезервЗавершитьНаставничествоПриИзменении(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_РезервЗавершитьНаставничествоПриИзмененииНаСервере(ИсходныйНомерСтроки) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.РезервЗавершитьНаставничествоПриИзмененииНаСервере(ЭтотОбъект, ИсходныйНомерСтроки);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Оставить(Команда)
	
	ТекущиеДанные = Элементы.Резерв.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Оставить");
	
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Исключить(Команда)
	
	ТекущиеДанные = Элементы.Резерв.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Отклонить");
	
	УстановитьДоступностьКоманд(ЭтотОбъект, ТекущиеДанные);
	КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьВторичныеДанныеФормы()
	ЗаполнитьВторичныеДанныеРезерва();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеДанныеРезерва()

	Для каждого Резерв Из Объект.Резерв Цикл
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеДействия(Резерв);
		КадровыйРезервКлиентСервер.ЗаполнитьОписаниеСтатуса(Резерв);
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКоманд(Форма, ТекущиеДанные)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РезервОставить",
		"Доступность",
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Отклонить"));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РезервИсключить",
		"Доступность",
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Оставить"));
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва()

	Если Не ЗначениеЗаполнено(Объект.УчастникКадровогоРезерва) Или Не ЗначениеЗаполнено(Объект.ДатаИсключения) Тогда
		Объект.Резерв.Очистить();
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = КадровыйРезервФормы.ПараметрыЗаполненияПозицииРезерваПоУчастникуКадровогоРезерва();
	ПараметрыЗаполнения.ТабличнаяЧасть = Объект.Резерв;
	ПараметрыЗаполнения.ДатаНачала = Объект.ДатаИсключения;
	ПараметрыЗаполнения.УчастникКадровогоРезерва = Объект.УчастникКадровогоРезерва;
	ПараметрыЗаполнения.Действие = ПредопределенноеЗначение("Перечисление.ДействияСКадровымиРезервистами.Отклонить");

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.ДополнитьПараметрыЗаполненияПозицииРезерваПоУчастникуКадровогоРезерва(ПараметрыЗаполнения);
	КонецЕсли;
	
	КадровыйРезервФормы.ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва(ПараметрыЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделениеУчастникаКадровогоРезерва()
	
	УчастникКадровогоРезерва = Объект.УчастникКадровогоРезерва;
	
	Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолучения.СписокФизическихЛиц = Объект.УчастникКадровогоРезерва;
		ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
		ПараметрыПолучения.КадровыеДанные = "МестоВСтруктуреПредприятия";
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
		Если СотрудникиОрганизации.Количество() > 0 Тогда
			Объект.Подразделение = СотрудникиОрганизации[0].МестоВСтруктуреПредприятия;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ДанныеКандидатов = МодульПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УчастникКадровогоРезерва));
		Если ДанныеКандидатов.Количество() > 0 Тогда
			Объект.Подразделение = ДанныеКандидатов[0].Подразделение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// См. КадровыйРезервФормы.ОтборИзПодразделения
&НаСервереБезКонтекста
Функция ОтборИзПодразделения(Знач Подразделение)

	Возврат КадровыйРезервФормы.ОтборИзПодразделения(Подразделение);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораУчастникаКадровогоРезерва(Знач ВыбранноеЗначение)
	
	КадровыйРезервФормы.ОбработкаВыбораУчастникаКадровогоРезерва(ВыбранноеЗначение, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ТипУчастникаКадровогоРезерваПриИзмененииНаСервере()
	
	КадровыйРезервФормы.УстановитьСвойстваУчастникаКадровогоРезерва(ЭтотОбъект);
	ЗаполнитьПозицииРезерваПоУчастникуКадровогоРезерва();
	
КонецПроцедуры

#КонецОбласти
